{
  "title": "الشروط والأحكام",
  "lastUpdated": "آخر تحديث: 16 فبراير 2026",
  "backToHome": "العودة للرئيسية",
  "section1": {
    "title": "1. المقدمة",
    "content": "مرحباً بك في CyberLabs. باستخدامك لمنصتنا، فإنك توافق على الالتزام بهذه الشروط والأحكام. إذا كنت لا توافق على أي جزء من هذه الشروط، يرجى عدم استخدام خدماتنا."
  },
  "section2": {
    "title": "2. شروط الحساب",
    "intro": "عند إنشاء حساب معنا، يجب عليك تقديم معلومات دقيقة وكاملة. أنت مسؤول عن:",
    "point1": "الحفاظ على أمان حسابك وكلمة المرور",
    "point2": "جميع الأنشطة التي تحدث تحت حسابك",
    "point3": "إخطارنا فوراً بأي استخدام غير مصرح به",
    "point4": "التأكد من أن معلومات حسابك دقيقة ومحدثة"
  },
  "section3": {
    "title": "3. الاستخدام المقبول",
    "intro": "توافق على عدم استخدام منصتنا من أجل:",
    "point1": "انتهاك أي قوانين أو لوائح سارية",
    "point2": "التعدي على حقوق الملكية الفكرية",
    "point3": "نقل كود ضار أو محتوى ضار",
    "point4": "محاولة الوصول غير المصرح به إلى الأنظمة",
    "point5": "مضايقة أو إساءة معاملة أو إيذاء المستخدمين الآخرين"
  },
  "section4": {
    "title": "4. الملكية الفكرية",
    "content": "جميع المحتويات والميزات والوظائف على CyberLabs مملوكة لنا ومحمية بموجب قوانين حقوق النشر والعلامات التجارية الدولية وقوانين الملكية الفكرية الأخرى. لا يجوز لك نسخ أو توزيع أو إنشاء أعمال مشتقة دون إذن كتابي صريح منا."
  },
  "section5": {
    "title": "5. تحديد المسؤولية",
    "content": "لن تكون CyberLabs والشركات التابعة لها مسؤولة عن أي أضرار غير مباشرة أو عرضية أو خاصة أو تبعية أو عقابية ناتجة عن استخدامك أو عدم قدرتك على استخدام الخدمة. لن تتجاوز مسؤوليتنا الإجمالية المبلغ الذي دفعته لنا في الـ 12 شهراً الماضية."
  },
  "section6": {
    "title": "6. التغييرات على الشروط",
    "content": "نحتفظ بالحق في تعديل هذه الشروط في أي وقت. سنقوم بإخطار المستخدمين بأي تغييرات جوهرية عبر البريد الإلكتروني أو من خلال منصتنا. يشكل الاستمرار في استخدام خدماتنا بعد التغييرات قبولاً للشروط الجديدة."
  },
  "section7": {
    "title": "7. اتصل بنا",
    "content": "إذا كان لديك أي أسئلة حول هذه الشروط والأحكام، يرجى الاتصال بنا:"
  }
}
